import {Component} from '@angular/core'

@Component({
  selector:'numbersComponent',
  templateUrl:'./numbers.component.html',
  styleUrls:['./numbers.component.css']
})
export class NumbersComponent {
  numbersJapanese = {
    '1': 'いち',
    '2': 'に',
    '3': 'さん',
    '4': 'よん / し',
    '5': 'ご',
    '6': 'ろく',
    '7': 'なな / しち',
    '8': 'はち',
    '9': 'きゅう',
    '10': 'じゅう',
    '11': 'じゅういさ',
    '12': 'じゅうに',
    '13': 'じゅうさん',
    '14': 'じゅうよん',
    '15': 'じゅうご',
    '16': 'じゅうろく',
    '17': 'じゅうなな',
    '18': 'じゅうはち',
    '19': 'じゅうきゅう',
    '20': 'にじゅう',
    '30': 'さんじゅう',
    '40': 'よんじゅう',
    '50': 'ごじゅう',
    '60': 'ろくじゅう',
    '70': 'ななじゅう',
    '80': 'はちじゅう',
    '90': 'きゅうじゅう',
    '100': 'ひゃく',
    '200':'',
    '300':'',
    '400':'',
    '500':'',
    '600':'',
    '700':'',
    '800':'',
    '900':'',
    '1000':'',
    '2000':'',
    '3000':'',
    '4000':'',
    '5000':'',
    '6000':'',
    '7000':'',
    '8000':'',
    '9000':'',
    '10000':'',
    '20000':'',
    '30000':'',
    '40000':'',
    '50000':'',
    '60000':'',
    '70000':'',
    '80000':'',
    '90000':'',


  }

  numbersIndex = [1,2,3,4,5,6,7,8,9,10];
  numbersIndexTwo = [11,12,13,14,15,16,17,18,19,20];
  numbersIndexThree = [30,40,50,60,70,80,90,100];
  numbersIndexFour = [100,200,300,400,500,600,700,800,900];
  numbersIndexFive = [1000,2000,3000,4000,5000,6000,7000,8000,9000];
  numbersIndexSix = [10000,20000,30000,40000,50000,60000,70000,80000,90000];

}
